# Lab: Introduction to Data Visualization

## Objective:
- Learn the basics of data types, formats, and data visualization using Python.

### Part 1: Data Types and Formats

1.1 Import necessary libraries:
- Pandas
- Numpy

In [71]:
import pandas as pd
import numpy as np

### 1.2 Create a simple dataset:
- Name    | Age | Salary
- Alice   | 25  | 50000
- Bob     | 30  | 60000
- Charlie | 35  | 75000
- David   | 22  | 45000

In [72]:
data_set = {
    "Name" : ["Alice", "Bob", "Charlie", "David"],
    "Age" : [25, 30, 35, 22],
    "Salary": [50000, 60000, 75000, 45000] 
}
df = pd.DataFrame(data_set)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3    David   22   45000

1.3 Display the dataset:

In [73]:
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   75000
3    David   22   45000

1.4 Check data types of columns:

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Salary  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

1.5 Convert 'Age' to float:

In [75]:
df['Age'].astype('float')

0    25.0
1    30.0
2    35.0
3    22.0
Name: Age, dtype: float64

1.6 Save the dataset to CSV:

In [76]:

df.to_csv('check.csv')

## Part 2: Data Visualization
2.1 Import Matplotlib library:

In [77]:
import matplotlib.pyplot as plt

2.2 Plot a simple line chart of Name and Age

In [78]:
# plt.bar(df['Name'], df['Age'])
# plt.xlabel("Name")
# plt.ylabel('Age')

plt.plot(df['Name'], df['Age'])
plt.close()

2.3 Create a bar chart for Salary:

In [79]:
plt.bar(df['Name'], df['Salary'])
plt.xlabel("Name")
plt.ylabel('Salary')
plt.close()

2.4 Scatter plot for Age and Salary:

In [82]:
plt.scatter(df['Age'], df['Salary'])
plt.savefig("scatter_plot.png")
plt.close()